___

<a href='https://www.cr4q.org/'> <img src='img/bb.png' /></a>
___

# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [3]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [5]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
# df.isnull().values.any()
df.isnull().sum().sum()

3

In [7]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [8]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [9]:
df.dropna(thresh=4)

Empty DataFrame
Columns: [A, B, C]
Index: []

In [10]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [11]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [15]:
# Import pandas package
import pandas as pd

# Define a dictionary containing employee data
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
		'Age':[27, 24, 22, 32],
		'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
		'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

# Convert the dictionary into DataFrame
df = pd.DataFrame(data)

# select all rows and 0 to 2 columns
print(df.iloc[:, 0:2])
print('the sample', df.sample(2))

     Name  Age
0     Jai   27
1  Princi   24
2  Gaurav   22
3    Anuj   32
the sample      Name  Age  Address Qualification
1  Princi   24   Kanpur            MA
3    Anuj   32  Kannauj           Phd

In [35]:
df[df['Age'] == 'Jai'] & df[df['Age'] == 'Anuj']

Empty DataFrame
Columns: [Name, Age, Address, Qualification]
Index: []

# Great Job!